const questions = [
    {
        text: "Коли розпочалась Помаранчева революція?",
        answers: [
            "А) 2003",
            "Б) 2004",
            "В) 2005",
            "Г) 2006"
        ],
        type: "radio"
    },
    {
        text: "Вкажіть причину Помаранчевої революції.",
        answers: [
            "А) зниження рівня життя населення",
            "Б) погіршення відносин України з ЄС",
            "В) погіршення відносин з Росією",
            "Г) масові фальсифікації на виборах"
        ],
        type: "radio"
    },
    {
        text: "Скільки турів виборів було за часів Помаранчевої революції?",
        answers: [
            "А) 2 тури",
            "Б) 3 тури",
            "В) 2 тури та повторне переголосування II туру",
            "Г) 1 тур та позачергові вибори Президента"
        ],
        type: "radio"
    },
    {
        text: "Віктор Ющенко набрав найбільшу кількість голосів в таких областях:",
        answers: [
            "А) Львівська",
            "Б) Запорізька",
            "В) Закарпатська",
            "Г) Тернопільська"
        ],
        type: "multi"
    },
    {
        text: "Встановіть історичні відповідності:",
        answers: [
            "1) Віктор Ющенко",
            "2) Віктор Янукович",
            "3) Петро Симоненко",
            "4) Олександр Мороз",
            "А) Соціалістична партія України",
            "Б) Комуністична партія України",
            "В) \"Наша Україна\"",
            "Г) \"Партія Регіонів\""
        ],
        type: "table"
    },
    {
        text: "Інавгурація Президента України Віктора Ющенка відбулася ...?",
        answers: [
            "А) 8 грудня 2004 р.",
            "Б) 8 січня 2005 р.",
            "В) 23 січня 2005 р.",
            "Г) 31 грудня 2004 р."
        ],
        type: "radio"
    },
    {
        text: "Що стало приводом до подій, зображених на фото?",
        image: "./src/orange.png",
        answers: [
            "А) загострення відносин з Російською Федерацією",
            "Б) свавілля правоохоронних органів і сил спецпризначення",
            "В) масові фальсифікації результатів президентських виборів",
            "Г) зрив підписання Угоди про асоціацію з Європейським Союзом"
        ],
        type: "radio"
    },
    {
        text: "Які культурні заходи здійснив в Україні В. Ющенко?",
        image: "./src/monument.png",
        answers: [
            "А) Заснування меморіалу жертвам Голодомору",
            "Б) створення музею \"Героїв Крут\"",
            "В) Відбудовано палац Розумовського",
            "Г) Створення музею Другої світової війни",
            "Д) Реконструкція Десятинної церкви"
        ],
        type: "multi"
    },
    {
        text: "Обрання Президентом України В. Януковича відбулось?",
        answers: [
            "А) 2009",
            "Б) 2010",
            "В) 2011",
            "Г) 2008"
        ],
        type: "radio"
    },
    {
        text: "Укладені В. Януковичем 21 квітня 2010 р. так звані Харківські угоди подовжували термін оренди на...?",
        answers: [
            "А) 10 років",
            "Б) 20 років",
            "В) 15 років",
            "Г) 25 років"
        ],
        type: "radio"
    },
    {
        text: "У якому році в Україні та Польщі відбувся фінал Чемпіонату Європи з футболу?",
        answers: [
            "А) 2012 р.",
            "Б) 2016 р.",
            "В) 2010 р.",
            "Г) 2014 р."
        ],
        type: "radio"
    },
    {
        text: "Акція, яка стала першою спробою організації опору політиці В. Януковича:",
        answers: [
            "А) мовний майдан",
            "Б) Євромайдан",
            "В) податковий майдан",
            "Г) \"Революція на граніті\""
        ],
        type: "radio"
    }
]

answers = ["B", "D", "C", ["A", "C", "D"], ["C", "D", "B", "A"], "C", "C", ["A", "B", "C"], "B", "D", "A", "C"];