const questions = [
    {
        text: "Вступ України до Ради Європи припав на період президентства",
        answers: [
            "А) Л. Кучми.",
            "Б) В. Ющенка.",
            "В) Л. Кравчука.",
            "Г) П. Порошенка."
        ],
        type: "radio"
    },
    {
        text: "Установіть відповідність між датами та подіями.",
        answers: [
            "1) 16 липня 1990 р.",
            "2) 24 серпня 1991 р.",
            "3) 9 листопада 1995 р.",
            "4) 28 червня 1996 р.",
            "А) Проведення перших альтернативних виборів до Верховної Ради УРСР",
            "Б) Прийняття Акта проголошення незалежності України",
            "В) Cхвалення Декларації про державний суверенітет України",
            "Г) урочиста церемонія вступу України до Ради Європи",
            "Ґ) прийняття Конституції України"
        ],
        type: "table"
    },
    {
        text: "Україна, приєднавшись у 1994 р. до Договору про нерозповсюдження ядерної зброї, отримала гарантії безпеки з боку",
        answers: [
            "А) США, Росії, Великої Британії",
            "Б) Китаю, США, Франції",
            "В) Росії, Білорусії, Казахстану",
            "Г) Німеччини, Франції, Китаю"
        ],
        type: "radio"
    },
    {
        text: "Що є свідченням співпраці незалежної України з Організацією Об'єднаних Націй?",
        answers: [
            "А) участь українських підрозділів у миротворчих операціях",
            "Б) приєднання до програми «Партнерство заради миру»",
            "В) проголошення без'ядерного статусу держави",
            "Г) розміщення на своїй території іноземних військових баз"
        ],
        type: "radio"
    },
    {
        text: "Що є свідченням співпраці незалежної України з Організацією Північноатлантичного Договору (НАТО)?",
        answers: [
            "А) відмова від загальної військової повинності для комплектування армії",
            "Б) розміщення на території України військових баз блоку",
            "В) проголошення без'ядерного статусу держави",
            "Г) приєднання до Програми «Партнерство заради миру»"
        ],
        type: "radio"
    },
    {
        text: "Характерними ознаками розвитку багатопартійності в Україні були:\n1 участь широких верств суспільства партійній роботі.\n2 географічна зорієнтованість партій.\n3 декларативний характер партійних програмних документів.",
        answers: [
            "А) 1, 2",
            "Б) 1, 3",
            "В) 2, 3",
            "Г) 1, 2, 3"
        ],
        type: "radio"
    },
    {
        text: "Установіть відповідність між подією та її наслідком.",
        answers: [
            "1) запровадження національної валюти – гривні",
            "2) «Помаранчева революція»",
            "3) проведення першого Всеукраїнського референдуму",
            "4) проведення перших альтернативних виборів до Верховної Ради УРСР",
            "А) обрання Президентом України В. Ющенка",
            "Б) створення передумов до виходу держави з економічної кризи",
            "В) виникнення парламентської опозиції",
            "Г) припинення існування Союзу Радянських Соціалістичних Республік",
            "Ґ) створення Автономної Республіки Крим"
        ],
        type: "table"
    },
    {
        text: "Розгляньте фото та виконайте завдання. Події, зафіксовані на фото, відбулися",
        image: "./src/orange.png",
        answers: [
            "А) 1990 р.",
            "Б) 2004 р.",
            "В) 2010 р.",
            "Г) 2013 р."
        ],
        type: "radio"
    },
    {
        text: "Розгляньте фото та виконайте завдання. Ці події ввійшли в історію під назвою",
        image: "./src/orange.png",
        answers: [
            "А) «революція троянд»",
            "Б) «революція Гідності»",
            "В) «революція на граніті»",
            "Г) «Помаранчева революція»"
        ],
        type: "radio"
    },
    {
        text: "Розгляньте фото та виконайте завдання. Що стало приводом до цих подій?",
        image: "./src/orange.png",
        answers: [
            "А) загострення відносин з Російською Федерацією",
            "Б) свавілля правоохоронних органів і сил спецпризначення",
            "В) масові фальсифікації результатів президентських виборів",
            "Г) зрив підписання Угоди про асоціацію з Європейським Союзом"
        ],
        type: "radio"
    }
]

answers = ["A", ["C", "B", "E", "D"], "A", "A", "D", "C", ["B", "A", "D", "C"], "B", "D", "C"];